rjjrbatarao/ESP_WIREGUARD/ESP8266_WIREGUARD/wireguardif.c
          // Might need to shuffle next key --> current keypair
          keypair_update(peer, keypair);

          // Check to see if we should rekey
          if (keypair->initiator && wireguard_expired(keypair->keypair_millis, REJECT_AFTER_TIME - peer->keepalive_interval - REKEY_TIMEOUT)) {
            peer->send_handshake = true;
          }

          // Make sure that link is reported as up
          netif_set_link_up(device->netif);

          if (pbuf->tot_len > 0) {
            //4a. Once the packet payload is decrypted, the interface has a plaintext packet. If this is not an IP packet, it is dropped.
            iphdr = (struct ip_hdr *)pbuf->payload;
            // Check for packet replay / dupes
            if (wireguard_check_replay(keypair, nonce)) {

              // 4b. Otherwise, WireGuard checks to see if the source IP address of the plaintext inner-packet routes correspondingly in the cryptokey routing table
              // Also check packet length!
#if LWIP_IPV4
              if (IPH_V(iphdr) == 4) {
                ip_addr_copy_from_ip4(dest, iphdr->dest);
                for (x = 0; x < WIREGUARD_MAX_SRC_IPS; x++) {
                  if (peer->allowed_source_ips[x].valid) {
                    if (ip_addr_netcmp(&dest, &peer->allowed_source_ips[x].ip, &peer->allowed_source_ips[x].mask)) {
                      dest_ok = true;
                      header_len = PP_NTOHS(IPH_LEN(iphdr));
                      break;
                    }
                  }
                }
              }
#endif /* LWIP_IPV4 */
#if LWIP_IPV6
              if (IPH_V(iphdr) == 6) {
                // TODO: IPV6 support for route filtering
                header_len = PP_NTOHS(IPH_LEN(iphdr));
                dest_ok = true;
              }
#endif /* LWIP_IPV6 */
              if (header_len <= pbuf->tot_len) {

                // 5. If the plaintext packet has not been dropped, it is inserted into the receive queue of the wg0 interface.
                if (dest_ok) {
                  // Send packet to be process by LWIP
                  ip_input(pbuf, device->netif);
                  // pbuf is owned by IP layer now
                  pbuf = NULL;
                }
              } else {
                // IP header is corrupt or lied about packet size
              }
            } else {
              // This is a duplicate packet / replayed / too far out of order
            }
          } else {
            // This was a keep-alive packet
          }
        }

        if (pbuf) {
          pbuf_free(pbuf);
        }
      }


    } else {
      //After Reject-After-Messages transport data messages or after the current secure session is Reject- After-Time seconds old,
      // whichever comes first, WireGuard will refuse to send or receive any more transport data messages using the current secure session,
      // until a new secure session is created through the 1-RTT handshake
      keypair_destroy(keypair);
    }

  } else {
    // Could not locate valid keypair for remote index
  }
}

static struct pbuf *wireguardif_initiate_handshake(struct wireguard_device *device, struct wireguard_peer *peer, struct message_handshake_initiation *msg, err_t *error) {
  struct pbuf *pbuf = NULL;
  err_t err = ERR_OK;
  if (wireguard_create_handshake_initiation(device, peer, msg)) {
    // Send this packet out!
    pbuf = pbuf_alloc(PBUF_TRANSPORT, sizeof(struct message_handshake_initiation), PBUF_RAM);
    if (pbuf) {
      err = pbuf_take(pbuf, msg, sizeof(struct message_handshake_initiation));
      if (err == ERR_OK) {
        // OK!
      } else {
        pbuf_free(pbuf);
        pbuf = NULL;
      }
    } else {
      err = ERR_MEM;
    }
  } else {
    err = ERR_ARG;
  }
  if (error) {
    *error = err;
  }
  return pbuf;
}

static void wireguardif_send_handshake_response(struct wireguard_device *device, struct wireguard_peer *peer) {
  struct message_handshake_response packet;
  struct pbuf *pbuf = NULL;
  err_t err = ERR_OK;

  if (wireguard_create_handshake_response(device, peer, &packet)) {

    wireguard_start_session(peer, false);

    // Send this packet out!
    pbuf = pbuf_alloc(PBUF_TRANSPORT, sizeof(struct message_handshake_response), PBUF_RAM);
    if (pbuf) {
      err = pbuf_take(pbuf, &packet, sizeof(struct message_handshake_response));
      if (err == ERR_OK) {
        // OK!
        wireguardif_peer_output(device->netif, pbuf, peer);
      }
      pbuf_free(pbuf);
    }
  }
}

static size_t get_source_addr_port(const ip_addr_t *addr, u16_t port, uint8_t *buf, size_t buflen) {
  size_t result = 0;

#if LWIP_IPV4
  if (IP_IS_V4(addr) && (buflen >= 4)) {
    U32TO8_BIG(buf + result, PP_NTOHL(ip4_addr_get_u32(addr)));
    result += 4;
  }
#endif
#if LWIP_IPV6
  if (IP_IS_V4(addr) && (buflen >= 16)) {
    U16TO8_BIG(buf + result + 0, IP6_ADDR_BLOCK1(addr));
    U16TO8_BIG(buf + result + 2, IP6_ADDR_BLOCK2(addr));
    U16TO8_BIG(buf + result + 4, IP6_ADDR_BLOCK3(addr));
    U16TO8_BIG(buf + result + 6, IP6_ADDR_BLOCK4(addr));
    U16TO8_BIG(buf + result + 8, IP6_ADDR_BLOCK5(addr));
    U16TO8_BIG(buf + result + 10, IP6_ADDR_BLOCK6(addr));
    U16TO8_BIG(buf + result + 12, IP6_ADDR_BLOCK7(addr));
    U16TO8_BIG(buf + result + 14, IP6_ADDR_BLOCK8(addr));
    result += 16;
  }
#endif
  if (buflen >= result + 2) {
    U16TO8_BIG(buf + result, port);
    result += 2;
  }
  return result;
}

static void wireguardif_send_handshake_cookie(struct wireguard_device *device, const uint8_t *mac1, uint32_t index, const ip_addr_t *addr, u16_t port) {
  struct message_cookie_reply packet;
  struct pbuf *pbuf = NULL;
  err_t err = ERR_OK;
  uint8_t source_buf[18];
  size_t source_len = get_source_addr_port(addr, port, source_buf, sizeof(source_buf));

  wireguard_create_cookie_reply(device, &packet, mac1, index, source_buf, source_len);

  // Send this packet out!
  pbuf = pbuf_alloc(PBUF_TRANSPORT, sizeof(struct message_cookie_reply), PBUF_RAM);
  if (pbuf) {
    err = pbuf_take(pbuf, &packet, sizeof(struct message_cookie_reply));
    if (err == ERR_OK) {
      wireguardif_device_output(device, pbuf, addr, port);
    }
    pbuf_free(pbuf);
  }
}

static bool wireguardif_check_initiation_message(struct wireguard_device *device, struct message_handshake_initiation *msg, const ip_addr_t *addr, u16_t port) {
  bool result = false;
  uint8_t *data = (uint8_t *)msg;
  uint8_t source_buf[18];
  size_t source_len;
  // We received an initiation packet check it is valid

  if (wireguard_check_mac1(device, data, sizeof(struct message_handshake_initiation) - (2 * WIREGUARD_COOKIE_LEN), msg->mac1)) {
    // mac1 is valid!
    if (!wireguard_is_under_load()) {
      // If we aren't under load we only need mac1 to be correct
      result = true;
    } else {
      // If we are under load then check mac2
      source_len = get_source_addr_port(addr, port, source_buf, sizeof(source_buf));

      result = wireguard_check_mac2(device, data, sizeof(struct message_handshake_initiation) - (WIREGUARD_COOKIE_LEN), source_buf, source_len, msg->mac2);

      if (!result) {
        // mac2 is invalid (cookie may have expired) or not present
        // 5.3 Denial of Service Mitigation & Cookies
        // If the responder receives a message with a valid msg.mac1 yet with an invalid msg.mac2, and is under load, it may respond with a cookie reply message
        wireguardif_send_handshake_cookie(device, msg->mac1, msg->sender, addr, port);
      }
    }

  } else {
    // mac1 is invalid
  }
  return result;
}

static bool wireguardif_check_response_message(struct wireguard_device *device, struct message_handshake_response *msg, const ip_addr_t *addr, u16_t port) {
  bool result = false;
  uint8_t *data = (uint8_t *)msg;
  uint8_t source_buf[18];
  size_t source_len;
  // We received an initiation packet check it is valid

  if (wireguard_check_mac1(device, data, sizeof(struct message_handshake_response) - (2 * WIREGUARD_COOKIE_LEN), msg->mac1)) {
    // mac1 is valid!
    if (!wireguard_is_under_load()) {
      // If we aren't under load we only need mac1 to be correct
      result = true;
    } else {
      // If we are under load then check mac2
      source_len = get_source_addr_port(addr, port, source_buf, sizeof(source_buf));

