rjjrbatarao/ESP_WIREGUARD/ESP8266_WIREGUARD/wireguardif.c
      result = wireguard_check_mac2(device, data, sizeof(struct message_handshake_response) - (WIREGUARD_COOKIE_LEN), source_buf, source_len, msg->mac2);

      if (!result) {
        // mac2 is invalid (cookie may have expired) or not present
        // 5.3 Denial of Service Mitigation & Cookies
        // If the responder receives a message with a valid msg.mac1 yet with an invalid msg.mac2, and is under load, it may respond with a cookie reply message
        wireguardif_send_handshake_cookie(device, msg->mac1, msg->sender, addr, port);
      }
    }

  } else {
    // mac1 is invalid
  }
  return result;
}


void wireguardif_network_rx(void *arg, struct udp_pcb *pcb, struct pbuf *p, const ip_addr_t *addr, u16_t port) {
  LWIP_ASSERT("wireguardif_network_rx: invalid arg", arg != NULL);
  LWIP_ASSERT("wireguardif_network_rx: invalid pbuf", p != NULL);
  // We have received a packet from the base_netif to our UDP port - process this as a possible Wireguard packet
  struct wireguard_device *device = (struct wireguard_device *)arg;
  struct wireguard_peer *peer;
  uint8_t *data = p->payload;
  size_t len = p->len; // This buf, not chained ones

  struct message_handshake_initiation *msg_initiation;
  struct message_handshake_response *msg_response;
  struct message_cookie_reply *msg_cookie;
  struct message_transport_data *msg_data;

  uint8_t type = wireguard_get_message_type(data, len);
#ifdef ESP8266
  DEBUG_MSG("network_rx: %08x:%d\r\n", addr->addr, port);
#else
  ESP_LOGI(TAG, "network_rx: %08x:%d\r\n", addr->u_addr.ip4.addr, port);
#endif
  switch (type) {
    case MESSAGE_HANDSHAKE_INITIATION:
      msg_initiation = (struct message_handshake_initiation *)data;
#ifdef ESP8266
      DEBUG_MSG("HANDSHAKE_INITIATION: %08x:%d\r\n", addr->addr, port);
#else
      ESP_LOGI(TAG, "HANDSHAKE_INITIATION: %08x:%d", addr->u_addr.ip4.addr, port);
#endif
      // Check mac1 (and optionally mac2) are correct - note it may internally generate a cookie reply packet
      if (wireguardif_check_initiation_message(device, msg_initiation, addr, port)) {

        peer = wireguard_process_initiation_message(device, msg_initiation);
        if (peer) {
          // Update the peer location
          update_peer_addr(peer, addr, port);

          // Send back a handshake response
          wireguardif_send_handshake_response(device, peer);
        }
      }
      break;

    case MESSAGE_HANDSHAKE_RESPONSE:
#ifdef ESP8266
      DEBUG_MSG("HANDSHAKE_RESPONSE: %08x:%d\r\n", addr->addr, port);
#else
      ESP_LOGI(TAG, "HANDSHAKE_RESPONSE: %08x:%d\r\n", addr->u_addr.ip4.addr, port);
#endif
      msg_response = (struct message_handshake_response *)data;

      // Check mac1 (and optionally mac2) are correct - note it may internally generate a cookie reply packet
      if (wireguardif_check_response_message(device, msg_response, addr, port)) {

        peer = peer_lookup_by_handshake(device, msg_response->receiver);
        if (peer) {
          // Process the handshake response
          wireguardif_process_response_message(device, peer, msg_response, addr, port);
        }
      }
      break;

    case MESSAGE_COOKIE_REPLY:
#ifdef ESP8266
      DEBUG_MSG("COOKIE_REPLY: %08x:%d\r\n", addr->addr, port);
#else
      ESP_LOGI(TAG, "COOKIE_REPLY: %08x:%d\r\n", addr->u_addr.ip4.addr, port);
#endif
      msg_cookie = (struct message_cookie_reply *)data;
      peer = peer_lookup_by_handshake(device, msg_cookie->receiver);
      if (peer) {
        if (wireguard_process_cookie_message(device, peer, msg_cookie)) {
          // Update the peer location
          update_peer_addr(peer, addr, port);

          // Don't send anything out - we stay quiet until the next initiation message
        }
      }
      break;

    case MESSAGE_TRANSPORT_DATA:
#ifdef ESP8266
      DEBUG_MSG("TRANSPORT_DATA: %08x:%d\r\n", addr->addr, port);
#else
      ESP_LOGI(TAG, "TRANSPORT_DATA: %08x:%d\r\n", addr->u_addr.ip4.addr, port);
#endif
      msg_data = (struct message_transport_data *)data;
      peer = peer_lookup_by_receiver(device, msg_data->receiver);
      if (peer) {
        // header is 16 bytes long so take that off the length
        wireguardif_process_data_message(device, peer, msg_data, len - 16, addr, port);
      }
      break;

    default:
      // Unknown or bad packet header
      break;
  }
  // Release data!
  pbuf_free(p);
}

static err_t wireguard_start_handshake(struct netif *netif, struct wireguard_peer *peer) {
  struct wireguard_device *device = (struct wireguard_device *)netif->state;
  err_t result;
  struct pbuf *pbuf;
  struct message_handshake_initiation msg;

  pbuf = wireguardif_initiate_handshake(device, peer, &msg, &result);
  if (pbuf) {
    result = wireguardif_peer_output(netif, pbuf, peer);
#ifdef ESP8266
    DEBUG_MSG("start handshake %08x,%d - %d\r\n", peer->ip.addr, peer->port, result);
#else
    ESP_LOGI(TAG, "start handshake %08x,%d - %d\r\n", peer->ip.u_addr.ip4.addr, peer->port, result);
#endif
    pbuf_free(pbuf);
    peer->send_handshake = false;
    peer->last_initiation_tx = wireguard_sys_now();
    memcpy(peer->handshake_mac1, msg.mac1, WIREGUARD_COOKIE_LEN);
    peer->handshake_mac1_valid = true;
    //DEBUG_MSG("peer handshake mac1 %s", peer->handshake_mac1);
  }

  return result;
}

static err_t wireguardif_lookup_peer(struct netif *netif, u8_t peer_index, struct wireguard_peer **out) {
  LWIP_ASSERT("netif != NULL", (netif != NULL));
  LWIP_ASSERT("state != NULL", (netif->state != NULL));
  struct wireguard_device *device = (struct wireguard_device *)netif->state;
  struct wireguard_peer *peer = NULL;
  err_t result;

  if (device->valid) {
    peer = peer_lookup_by_peer_index(device, peer_index);
    if (peer) {
      result = ERR_OK;
    } else {
      result = ERR_ARG;
    }
  } else {
    result = ERR_ARG;
  }
  *out = peer;
  return result;
}


err_t wireguardif_connect(struct netif *netif, u8_t peer_index) {
  struct wireguard_peer *peer;
#ifdef ESP8266
  DEBUG_MSG("starting peer lookup \r\n");
#else
  ESP_LOGI(TAG, "starting peer lookup \r\n");
#endif
  err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
  if (result == ERR_OK) {
    // Check that a valid connect ip and port have been set
    if (!ip_addr_isany(&peer->connect_ip) && (peer->connect_port > 0)) {
      // Set the flag that we want to try connecting
#ifdef ESP8266
      DEBUG_MSG("peer connect ip %08x:%d\r\n", peer->connect_ip, peer->connect_port);
#else
      ESP_LOGI(TAG, "peer connect ip %08x:%d\r\n", peer->connect_ip, peer->connect_port);
#endif
      peer->active = true;
      peer->ip = peer->connect_ip;
      peer->port = peer->connect_port;
      result = ERR_OK;
    } else {
#ifdef ESP8266
      DEBUG_MSG("lookup peer error %d\r\n", result);
#else
      ESP_LOGI(TAG, "lookup peer error %d\r\n", result);
#endif
      result = ERR_ARG;
    }
  } else {
#ifdef ESP8266
    DEBUG_MSG("unknown error %d\r\n", result);
#else
    ESP_LOGI(TAG, "unknown error %d\r\n", result);
#endif
  }
  return result;
}

err_t wireguardif_disconnect(struct netif *netif, u8_t peer_index) {
  struct wireguard_peer *peer;
  err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
  if (result == ERR_OK) {
    // Set the flag that we want to try connecting
    peer->active = false;
    // Wipe out current keys
    keypair_destroy(&peer->next_keypair);
    keypair_destroy(&peer->curr_keypair);
    keypair_destroy(&peer->prev_keypair);
    result = ERR_OK;
  }
  return result;
}

