rjjrbatarao/ESP_WIREGUARD/ESP8266_WIREGUARD/wireguardif.c
err_t wireguardif_peer_is_up(struct netif *netif, u8_t peer_index, ip_addr_t *current_ip, u16_t *current_port) {
  struct wireguard_peer *peer;
  err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
  if (result == ERR_OK) {
    if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid)) {
      result = ERR_OK;
    } else {
      result = ERR_CONN;
    }
    if (current_ip) {
      *current_ip = peer->ip;
    }
    if (current_port) {
      *current_port = peer->port;
    }
  }
  return result;
}

err_t wireguardif_remove_peer(struct netif *netif, u8_t peer_index) {
  struct wireguard_peer *peer;
  err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
  if (result == ERR_OK) {
    crypto_zero(peer, sizeof(struct wireguard_peer));
    peer->valid = false;
    result = ERR_OK;
  }
  return result;
}

err_t wireguardif_update_endpoint(struct netif *netif, u8_t peer_index, const ip_addr_t *ip, u16_t port) {
  struct wireguard_peer *peer;
  err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
  if (result == ERR_OK) {
    peer->connect_ip = *ip;
    peer->connect_port = port;
    result = ERR_OK;
  }
  return result;
}


err_t wireguardif_add_peer(struct netif *netif, struct wireguardif_peer *p, u8_t *peer_index) {
  LWIP_ASSERT("netif != NULL", (netif != NULL));
  LWIP_ASSERT("state != NULL", (netif->state != NULL));
  LWIP_ASSERT("p != NULL", (p != NULL));
#ifdef ESP8266
  DEBUG_MSG("adding remote peer\r\n");
#else
  ESP_LOGI(TAG, "adding remote peer\r\n");
#endif
  struct wireguard_device *device = (struct wireguard_device *)netif->state;
  err_t result;
  uint8_t public_key[WIREGUARD_PUBLIC_KEY_LEN];
  size_t public_key_len = sizeof(public_key);
  struct wireguard_peer *peer = NULL;

  uint32_t t1 = wireguard_sys_now();

  if (wireguard_base64_decode(p->public_key, public_key, &public_key_len)
      && (public_key_len == WIREGUARD_PUBLIC_KEY_LEN)) {

    // See if the peer is already registered
    peer = peer_lookup_by_pubkey(device, public_key);
    if (!peer) {
      // Not active - see if we have room to allocate a new one
      peer = peer_alloc(device);
      if (peer) {

        if (wireguard_peer_init(device, peer, public_key, p->preshared_key)) {

          peer->connect_ip = p->endpoint_ip;
          peer->connect_port = p->endport_port;
          peer->ip = peer->connect_ip;
          peer->port = peer->connect_port;
          if (p->keep_alive == WIREGUARDIF_KEEPALIVE_DEFAULT) {
            peer->keepalive_interval = KEEPALIVE_TIMEOUT;
          } else {
            peer->keepalive_interval = p->keep_alive;
          }
          peer_add_ip(peer, p->allowed_ip, p->allowed_mask);
          memcpy(peer->greatest_timestamp, p->greatest_timestamp, sizeof(peer->greatest_timestamp));

          result = ERR_OK;
        } else {
          result = ERR_ARG;
#ifdef ESP8266
          DEBUG_MSG("peer err arg1 %d\r\n", result);
#else
          ESP_LOGI(TAG, "peer err arg1 %d\r\n", result);
#endif
        }
      } else {
        result = ERR_MEM;
#ifdef ESP8266
        DEBUG_MSG("peer err mem %d\r\n", result);
#else
        ESP_LOGI(TAG, "peer err mem %d\r\n", result);
#endif
      }
    } else {
      result = ERR_OK;
    }
  } else {
    result = ERR_ARG;
#ifdef ESP8266
    DEBUG_MSG("peer err arg2 %d\r\n", result);
#else
    ESP_LOGI(TAG, "peer err arg2 %d\r\n", result);
#endif
  }
#ifdef ESP8266
  DEBUG_MSG("peer result %d\r\n", result);
#else
  ESP_LOGI(TAG, "peer result %d\r\n", result);
#endif
  if (!wireguard_base64_decode(p->public_key, public_key, &public_key_len)) {
#ifdef ESP8266
    DEBUG_MSG("b64 decode failed pubkey: %s\r\n", p->public_key);
#else
    ESP_LOGI(TAG, "b64 decode failed pubkey: %s\r\n", p->public_key);
#endif
  } else if (public_key_len != WIREGUARD_PUBLIC_KEY_LEN) {
#ifdef ESP8266
    DEBUG_MSG("public key len mismatch %d:%d\r\n", public_key_len, WIREGUARD_PUBLIC_KEY_LEN);
#else
    ESP_LOGI(TAG, "public key len mismatch %d:%d\r\n", public_key_len, WIREGUARD_PUBLIC_KEY_LEN);
#endif
  }
  uint32_t t2 = wireguard_sys_now();
#ifdef ESP8266
  DEBUG_MSG("Adding peer took %ldms\r\n", (t2 - t1));
#else
  ESP_LOGI(TAG, "Adding peer took %ldms\r\n", (t2 - t1));
#endif
  if (peer_index) {
    if (peer) {
      *peer_index = wireguard_peer_index(device, peer);
    } else {
      *peer_index = WIREGUARDIF_INVALID_INDEX;
    }
  }
  return result;
}

static bool should_send_initiation(struct wireguard_peer *peer) {
  bool result = false;
  if (wireguardif_can_send_initiation(peer)) {
    if (peer->send_handshake) {
      result = true;
#ifdef ESP8266
      DEBUG_MSG("peer send handshake\r\n");
#else
      ESP_LOGI(TAG, "peer send handshake\r\n");
#endif
    } else if (peer->curr_keypair.valid && !peer->curr_keypair.initiator && wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME - peer->keepalive_interval)) {
      result = true;
#ifdef ESP8266
      DEBUG_MSG("peer keypair valid & wireguard expired\r\n");
#else
      ESP_LOGI(TAG, "peer keypair valid & wireguard expired\r\n");
#endif
    } else if (!peer->curr_keypair.valid && peer->active) {
      result = true;
#ifdef ESP8266
      DEBUG_MSG("peer keypair valid & active\r\n");
#else
      ESP_LOGI(TAG, "peer keypair valid & active\r\n");
#endif
    } else {
#ifdef ESP8266
      //DEBUG_MSG("peer false\r\n");
#else
      //ESP_LOGI(TAG, "peer false\r\n");
#endif
    }
  } else {
    //DEBUG_MSG("peer cant send initialization\r\n");
  }
  return result;
}

static bool should_send_keepalive(struct wireguard_peer *peer) {
  bool result = false;
  if (peer->keepalive_interval > 0) {
    if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid)) {
      if (wireguard_expired(peer->last_tx, peer->keepalive_interval)) {
        result = true;
      }
    }
  }
  return result;
}

static bool should_destroy_current_keypair(struct wireguard_peer *peer) {
  bool result = false;
  if (peer->curr_keypair.valid &&
      (wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME) ||
       (peer->curr_keypair.sending_counter >= REJECT_AFTER_MESSAGES))
     ) {
    result = true;
  }
  return result;
}

