rjjrbatarao/ESP_WIREGUARD/ESP8266_WIREGUARD/wireguardif.c
static bool should_reset_peer(struct wireguard_peer *peer) {
  bool result = false;
  if (peer->curr_keypair.valid && (wireguard_expired(peer->curr_keypair.keypair_millis, REJECT_AFTER_TIME * 3))) {
    result = true;
  }
  return result;
}

static void wireguardif_tmr(void *arg) {
  struct wireguard_device *device = (struct wireguard_device *)arg;
  struct wireguard_peer *peer;
  int x;
  // Reschedule this timer
  sys_timeout(WIREGUARDIF_TIMER_MSECS, wireguardif_tmr, device);

  // Check periodic things
  bool link_up = false;
  for (x = 0; x < WIREGUARD_MAX_PEERS; x++) {
    peer = &device->peers[x];
    if (peer->valid) {
      // Do we need to rekey / send a handshake?
      if (should_reset_peer(peer)) {
        // Nothing back for too long - we should wipe out all crypto state
        keypair_destroy(&peer->next_keypair);
        keypair_destroy(&peer->curr_keypair);
        keypair_destroy(&peer->prev_keypair);
        // TODO: Also destroy handshake?

        // Revert back to default IP/port if these were altered
        peer->ip = peer->connect_ip;
        peer->port = peer->connect_port;
      }
      if (should_destroy_current_keypair(peer)) {
        // Destroy current keypair
        keypair_destroy(&peer->curr_keypair);
      }
      if (should_send_keepalive(peer)) {
        wireguardif_send_keepalive(device, peer);
      }
      if (should_send_initiation(peer)) {
        wireguard_start_handshake(device->netif, peer);
      }

      if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid)) {
        link_up = true;
      }
    }
  }

  if (!link_up) {
    // Clear the IF-UP flag on netif
    netif_set_link_down(device->netif);
  }
}

void wireguardif_shutdown(struct netif *netif) {
  LWIP_ASSERT("netif != NULL", (netif != NULL));
  LWIP_ASSERT("state != NULL", (netif->state != NULL));

  struct wireguard_device * device = (struct wireguard_device *)netif->state;
  // Disable timer.
  sys_untimeout(wireguardif_tmr, device);
  // remove UDP context.
  if ( device->udp_pcb ) {
    udp_disconnect(device->udp_pcb);
    udp_remove(device->udp_pcb);
    device->udp_pcb = NULL;
  }
  // remove device context.
  free(device);
  netif->state = NULL;
}

err_t wireguardif_init(struct netif *netif) {
  err_t result;
  //err_t err;
  struct wireguardif_init_data *init_data;
  struct wireguard_device *device;
  struct udp_pcb *udp;
  uint8_t private_key[WIREGUARD_PRIVATE_KEY_LEN];
  size_t private_key_len = sizeof(private_key);
  char lwip_netif_name[8] = {0,};
  struct netif* underlying_netif = NULL;
#ifdef ESP8266
  underlying_netif = eagle_lwip_getif(STATION_IF);
#else
  tcpip_adapter_get_netif(TCPIP_ADAPTER_IF_STA, &underlying_netif);
#endif
#ifdef ESP8266
  DEBUG_MSG("underlying_netif = %p\r\n", underlying_netif);
#else
  ESP_LOGI(TAG, "underlying_netif = %p\r\n", underlying_netif);
#endif
  LWIP_ASSERT("netif != NULL", (netif != NULL));
  LWIP_ASSERT("state != NULL", (netif->state != NULL));

  // We need to initialise the wireguard module
  wireguard_init();
#ifdef ESP8266
  DEBUG_MSG("wireguard module initialized.\r\n");
#else
  ESP_LOGI(TAG, "wireguard module initialized.\r\n");
#endif
  if (netif && netif->state) {

    // The init data is passed into the netif_add call as the 'state' - we will replace this with our private state data
    init_data = (struct wireguardif_init_data *)netif->state;

    // Clear out and set if function is successful
    netif->state = NULL;

    if (wireguard_base64_decode(init_data->private_key, private_key, &private_key_len)
        && (private_key_len == WIREGUARD_PRIVATE_KEY_LEN)) {

      udp = udp_new();

      if (udp) {
        result = udp_bind(udp, IP_ADDR_ANY, init_data->listen_port); // Note this listens on all interfaces! Really just want the passed netif
        if (result == ERR_OK) {
          device = (struct wireguard_device *)mem_calloc(1, sizeof(struct wireguard_device));
          if (device) {
            device->netif = netif;
            
            if (init_data->bind_netif) {// this is for ethernet netif
              udp_bind_netif(udp, init_data->bind_netif);
            } else { // this is for wifi sta netif
              udp_bind_netif(udp, underlying_netif);
            }

            device->udp_pcb = udp;
#ifdef ESP8266
            DEBUG_MSG("start device initialization\r\n");
#else
            ESP_LOGI(TAG, "start device initialization\r\n");
#endif
            // Per-wireguard netif/device setup
            uint32_t t1 = wireguard_sys_now();
            if (wireguard_device_init(device, private_key)) {
              uint32_t t2 = wireguard_sys_now();
#ifdef ESP8266
              DEBUG_MSG("Device init took %ldms\r\n", (t2 - t1));
#else
              ESP_LOGI(TAG, "Device init took %ldms\r\n", (t2 - t1));
#endif
#if LWIP_CHECKSUM_CTRL_PER_NETIF
              NETIF_SET_CHECKSUM_CTRL(netif, NETIF_CHECKSUM_ENABLE_ALL);
#endif
              netif->state = device;
              netif->name[0] = 'w';
              netif->name[1] = 'g';
              netif->output = wireguardif_output;
              netif->linkoutput = NULL;
              netif->hwaddr_len = 0;
              netif->mtu = WIREGUARDIF_MTU;
              // We set up no state flags here - caller should set them
              // NETIF_FLAG_LINK_UP is automatically set/cleared when at least one peer is connected
              netif->flags = 0;

              udp_recv(udp, wireguardif_network_rx, device);

              // Start a periodic timer for this wireguard device
              sys_timeout(WIREGUARDIF_TIMER_MSECS, wireguardif_tmr, device);

              result = ERR_OK;
            } else {
#ifdef ESP8266
              DEBUG_MSG("failed to initialize WireGuard device.\r\n");
#else
              ESP_LOGI(TAG, "failed to initialize WireGuard device.\r\n");
#endif
              mem_free(device);
              device = NULL;
              udp_remove(udp);
              result = ERR_ARG;
            }
          } else {
#ifdef ESP8266
            DEBUG_MSG("failed to allocate device context.\r\n");
#else
            ESP_LOGI(TAG, "failed to allocate device context.\r\n");
#endif
            udp_remove(udp);
            result = ERR_MEM;
          }
        } else {
#ifdef ESP8266
          DEBUG_MSG("failed to bind UDP err=%d\r\n", result);
#else
          ESP_LOGI(TAG, "failed to bind UDP err=%d\r\n", result);
#endif
          udp_remove(udp);
        }

      } else {
#ifdef ESP8266
        DEBUG_MSG("failed to allocate UDP\r\n");
#else
        ESP_LOGI(TAG, "failed to allocate UDP\r\n");
#endif
        result = ERR_MEM;
      }
    } else {
#ifdef ESP8266
      DEBUG_MSG("invalid init_data private key\r\n");
#else
      ESP_LOGI(TAG, "invalid init_data private key\r\n");
#endif
      result = ERR_ARG;
    }
  } else {
#ifdef ESP8266
    DEBUG_MSG("netif or state is NULL: netif=%p, netif.state:%p\r\n", netif, netif ? netif->state : NULL);
#else
    ESP_LOGI(TAG, "netif or state is NULL: netif=%p, netif.state:%p\r\n", netif, netif ? netif->state : NULL);
#endif
    result = ERR_ARG;
  }
  return result;
}

void wireguardif_peer_init(struct wireguardif_peer *peer) {
  LWIP_ASSERT("peer != NULL", (peer != NULL));
  memset(peer, 0, sizeof(struct wireguardif_peer));
  // Caller must provide 'public_key'
  peer->public_key = NULL;
  ip4_addr_set_any(&peer->endpoint_ip);
  peer->endport_port = WIREGUARDIF_DEFAULT_PORT;
  peer->keep_alive = WIREGUARDIF_KEEPALIVE_DEFAULT;
  ip4_addr_set_any(&peer->allowed_ip);
  ip4_addr_set_any(&peer->allowed_mask);
  memset(peer->greatest_timestamp, 0, sizeof(peer->greatest_timestamp));
  peer->preshared_key = NULL;
}
